Local $StrWin[4] = ["Ad Hoc 1.00", "Настройки сканирования системы", "Внимание!", "Следующие файлы не были скопированы/перемещены:"]

Local $StrMsg[4] = ["Сравнение невозможно. Проверьте настройки сканирования системы.", _
	 "Очистить ""...\PortApp\Data"" от найденных файлов?", _
	 "Создать установочный файл полученного портативного приложения?", _
	 "Вы уверены?"]

Local $StrBlk[16] = ["", _
	 "Вы запустили программу Ad Hoc 1.00", _
	 "Данная утилита предназначена для создания переносных приложений в формате PAF (PortableApps.com Format)." & @CRLF & @CRLF & _
	 "Коротко структуру формата PAF можно представить так: это загрузчик, директория с установленным приложением и директория с его настройками." & @CRLF & @CRLF & _
	 "Портативное приложение, созданное с помощью Ad Hoc, работает из любого каталога, при этом оно не оставляет следов своей работы в системе." & @CRLF & @CRLF & _
	 "Для продолжения нажмите кнопку Далее.", _
	 "Подождите...", _
	 "Теперь выполните установку приложения." & @CRLF & @CRLF & _
	 "Приложение следует устанавливать в каталог ""...\Ad Hoc\App\PortApp\App"". Подробнее о структуре портативной программы смотрите в Readme.rtf." & @CRLF & @CRLF & _
	 "Если после установки приложения потребуется перезагрузка, выполните ее.", _
	 "Сравнение данных...", _
	 "Копирование файлов...", _
	 "Перемещение файлов...", _
	 "Сверка файлов и подготовка списков...", _
	 "Выберите исполняемые файлы, для которых будут созданы загрузчики:", _
	 "Создание исходных текстов на AutoIt...", _
	 "Готово. Нажмите кнопку Компиляция для сборки загрузчиков.", _
	 "Выберите диски для сканирования:", _
	 "CPUs:", _
	 "Запустить редактор строк StrMngr.exe?", _
	 "Добавить в архив каталог ""...\PortApp\Data"", создав тем самым его резервную копию?"]

Local $StrBtn[12] = ["Далее >", "< Назад", "Прервать", "Отмена", "OK", "Компиляция", "Начать", "Настройки", _
	 "Да", "Да всегда", "Нет", "Нет никогда"]

Local $StrGrp[4] = ["Выберите один из двух вариантов:", _
	 "Выполнить первоначальное сканирование реестра и файловой системы", _
	 "Выполнить завершающее сканирование реестра и файловой системы", _
	 "Отметьте разделы реестра для сканирования:"]

Local $StrRad[2] = ["Первичный сбор данных", "Поиск изменений в системе"]

Local $StrTlTp[5] = ["Выберите данный пункт, если приложение" & @CRLF & "еще не устанавливалось", _
	 "Отметьте, если после установки приложения" & @CRLF & "была перезагрузка", _
	 "Если отмечено, то из каталога ""...\Ad Hoc\Data"" " & @CRLF & "будут удалены все файлы, кроме Settings.ini", _
	 "Добавление в архив...", _
	 "Компиляция..."]

Local $StrChk[4] = ["HKEY_LOCAL_MACHINE", "HKEY_CURRENT_USER", " Перемещать файлы и данные реестра вместо" & @CRLF & " их копирования", _
	 "Удалить временные файлы"]

Local $StrLiVw[2] = ["Имя|Путь", "Название диска|Размер"]

Local $StrCntxt[5] = ["Выбрать", "Отменить", "", "Выбрать все", "Отменить для всех"]

Local $StrUnitInf = " ГБ"

Local $StrTray[7] = ["Повторить добавление в архив", "Повторить компиляцию", "", _
	 "Прервать добавление в архив", "Прервать компиляцию", "", "Выйти"]
